package Task06;

//6. Написать программу нахождения суммы большего и меньшего из трех чисел.

public class Main {

	public static void main(String[] args) {

		System.out.println(Numbers.checkNumbers(2, 5, 8));
	}

}
